{
    "0": "SUMMARY\nSeasoned Senior ML Engineer with over 8 years of experience designing and deploying intelligent AI-driven\nsolutions specialized in Generative AI, Agent AI, LLM, CV, and NLP. Strong expertise in cloud-native\ndeployments for web and mobile platforms. Skilled at integrating AI innovations into scalable customer-facing\napplications, leveraging modern DevOps practices and agile development to optimize performance and\nreliability.\nCore Competencies\nGenerative AI, Agent AI & Large Language Models (LLMs)\nNatural Language Processing (NLP) & Conversational AI & Computer Vision (CV)\nCloud AI/ML Platforms (AWS, Google Cloud, Azure)\nWeb & Mobile AI Deployment (React, React Native)\nTypeScript & Python Software Development\nDevOps: CI/CD, Infrastructure as Code (Terraform, CloudFormation)\nAutomated Testing Frameworks (Jest, Mocha)\nMicroservices & Serverless Architectures\nAgile Collaboration & Cross-Functional Teams\nCloud Security & Compliance Best Practices\nEXPERIENCE\nNexaAI Technologies — USA (Remote)\nSenior ML Engineer March 2020 – September 2024\n• Led development of conversational AI platforms using AWS AI services and proprietary LLMs to\nimprove user engagement and automate support workflows, resulting in a 25% higher resolution rate\non first contact.\n• Architected scalable AI model deployments for web and mobile using TypeScript/React and cloud-\nnative solutions.\n• Established CI/CD pipelines and Infrastructure as Code to streamline deployments and reduce\ndowntime by 40%.\n• Collaborated with product and operations teams to embed AI chatbots into contact center systems\nwith zero service disruptions.\nXnor.ai — USA (Remote)\nLead NLP Engineer October 2019 – February 2020\n• Developed and fine-tuned custom NLP modules and LLM-powered customer support tools on AWS\nLambda-based serverless infrastructure to enhance scalability.\n• Transitioned legacy monolith systems into modular microservices, reducing technical debt and\nboosting maintainability.\n• Provided leadership in agile sprint planning, review, and mentoring junior engineers.\nWing Harrison\nSenior Machine Learning Engineer | Generative AI & LLM\nSpecialist\nLos Angeles | Remote Ready | harrisonwing4@gmail.com | +1 323 792 3865VocalTech AI Startup — San Francisco, USA (Remote)\nSenior AI/Speech Processing Engineer September 2018 - March 2020\n• Innovated voice cloning solutions using fine-tuned RVC models within React Native and Python\nFastAPI frameworks.\n• Delivered AI-powered medical interview analytics leveraging Whisper and Claude 2 models.\n• Engineered voice authentication and speaker diarization APIs, integrating STT, TTS, and telephony\nAPIs (Deepgram, OpenAI, ElevenLabs, Twilio) for seamless phone automation.\nChatGenie Technologies — Barcelona, Spain (Hybrid)\nMachine Learning Engineer July 2017 – August 2019\n• Developed multilingual large language model chatbots tailored for e-commerce platforms, decreasing\naverage customer wait times by 40%.\n• Built sentiment and recommendation engines using state-of-the-art BERT and custom fine-tuning\ntechniques.\n• Integrated containerized ML pipelines with Docker and AWS to enable rapid experimentation and\nreliable updates.\nEDUCATION\nThe University of Southern California, Los Angeles\nBachelor of Engineering in Computer Science, Sep. 2011 – Jun. 2015"
}